# US - Baby Names

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('babynames.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.pop('Unnamed: 0')
baby_names.pop('Id')

0            11350
1            11351
2            11352
3            11353
4            11354
            ...
1016390    5647422
1016391    5647423
1016392    5647424
1016393    5647425
1016394    5647426
Name: Id, Length: 1016395, dtype: int64

### Step 6. Is there more male or female names in the dataset?

In [5]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [6]:
names = baby_names.groupby('Name').sum()
names

           Year  Count
Name
Aaban      4027     12
Aadan      8039     23
Aadarsh    2009      5
Aaden    393963   3426
Aadhav     2014      6
...         ...    ...
Zyra      14085     42
Zyrah      4024     11
Zyren      2013      6
Zyria     20089     59
Zyriah    18087     58

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [7]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [8]:
baby_names['Name'].mode().iloc[0]

'Riley'

### Step 10. How many different names have the least occurrences?

In [9]:
(names.Count == names.Count.min()).sum()

2578

### Step 11. What is the median name occurrence?

In [23]:
(names.Count == names.Count.median()).sum()

66

### Step 12. What is the standard deviation of names?

In [11]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [12]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03